troubleshooting_tips.org
:PROPERTIES:
:ID:       2a9df823-aedc-475f-97d5-8d271e046dd1
:END:
#+title: Troubleshooting Tips
#+subtitle:Brookstone
#+filetags:Brookstone

#+options: toc:nil
#+begin_center
/In this document you will find common questions/issues that you may encounter with your school issued technology./
/Alongside, you will find a variety of different troubleshooting tips that may aid you in combating these problems./
/As we are limited in on-site resources, we encourage you to look over this document before requesting personal assistance within the IT chat./
/Thank you./
#+end_center
#+begin_export latex
\tableofcontents \clearpage
#+END_EXPORT

* Laptops
** Lenovo
-----
*** Printing
Q: ~I have sent a print job, however I do not see it in queue for release?~
+ First -- Confirm you are connected to the "Brookstone" WiFi -> *Attempt to reprint if connected to a different network*
+ Else -- Open the settings application on your laptop; search for the devices and printers menu; click on the printer you sent the file to and open up the queue page:
  * If you see your file here and a message that the queue/file is paused; right click on the document and click "unpause queue" -> *Check if your document has made it to the printer*

+ Else -- If you bring your mouse to the bottom right of the screen near the date and time; look for a button that looks like this " ^ "; click on it; here find the green printer icon (PaperCut) and click on "View Printers".
  * If you are prompted with a *login screen* then login with your @brookstoneschools.org credentials; go to "install printers" on the side of the screen and install the printers you need to use -> *Attempt to reprint*
  * otherwise, click refresh -> *Attempt to reprint*

#+begin_export latex
\clearpage
#+end_export

** Macbook
-----
*** Printing
Q: ~I have sent a print job, however I do not see it in queue for release?~
+ First -- Confirm you are connected to the "Brookstone" WiFi -> *Attempt to reprint if connected to a different network*
+ Else -- Open the settings application on your laptop; search for the devices and printers menu; click on the printer you sent the file to and open up the queue page:
  * If you see your file here and a message that the queue/file is paused; right click on the document and click "unpause queue" -> *Check if your document has made it to the printer*

+ Else -- At the very top of your screen (near the date/time) look for a green printer icon (PaperCut) and click on "View Printers".
  * If you are prompted with a *login screen* then login with your @brookstoneschools.org credentials; go to "install printers" on the side of the screen and install the printers you need to use -> *Attempt to reprint*
  * otherwise, click refresh -> *Attempt to reprint*


#+begin_export latex
\clearpage
#+end_export

* iPads
** Apple Classroom
-----
Q: ~How do I set up Apple Classroom?~
+ You can set up Apple Classroom using the instructions within this document: [[https://docs.google.com/document/d/1VQ7f4V_Gj16oRHccW3Lk0xK8nFByXDQ_1gwRT2M16BY/edit?usp=sharing][Apple Classroom Instructions]]
** General
-----
*** Unresponsive iPad
Q: ~My iPad seems to be frozen | I cannot interact with the screen~
+ In most cases, the best option is to hard restart the device; Press buttons in this order:
  * Volume up, Volume down, then Hold down the power button until the screen shuts off completely.
  * Wait 10 seconds and then hold the power button again until the Apple Logo appears on the screen.
+ Once this is done, your iPad should function as intended. If not, please reach out to IT

#+begin_export latex
\clearpage
#+end_export
* Chromebooks
** General
-----
Q: ~How my students print with their chromebooks~
+ All Chromebooks are currently set up with our print server (PaperCut), so printing should be a relatively painless process for students!
  * Just as you would with your teacher laptops, selecting print on a document (or pressing ctrl + p) will open a window to select which printer you would like to send a job to.
  * Select your printer and follow the instructions listed on the screen; Once completed, retrieve the document from the printer!
#+begin_export latex
\clearpage
#+end_export
* Smartboards
-----
