troubleshooting_tips.tex
% Created 2025-09-12 Fri 11:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Joel Boynton}
\date{\today}
\title{Troubleshooting Tips\\\medskip
\large Brookstone}
\hypersetup{
 pdfauthor={Joel Boynton},
 pdftitle={Troubleshooting Tips},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.3 (Org mode 9.7.29)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{center}
\emph{In this document you will find common questions/issues that you may encounter with your school issued technology.}
\emph{Alongside, you will find a variety of different troubleshooting tips that may aid you in combating these problems.}
\emph{As we are limited in on-site resources, we encourage you to look over this document before requesting personal assistance within the IT chat.}
\emph{Thank you.}
\end{center}
\tableofcontents \clearpage
\section{Laptops}
\label{sec:org6911c13}
\subsection{Lenovo}
\label{sec:org937fd9a}
\noindent\rule{\textwidth}{0.5pt}
\subsubsection{Printing}
\label{sec:org802f848}
Q: \texttt{I have sent a print job, however I do not see it in queue for release?}
\begin{itemize}
\item First -- Confirm you are connected to the ``Brookstone'' WiFi -> \textbf{Attempt to reprint if connected to a different network}
\item Else -- Open the settings application on your laptop; search for the devices and printers menu; click on the printer you sent the file to and open up the queue page:
\begin{itemize}
\item If you see your file here and a message that the queue/file is paused; right click on the document and click ``unpause queue'' -> \textbf{Check if your document has made it to the printer}
\end{itemize}

\item Else -- If you bring your mouse to the bottom right of the screen near the date and time; look for a button that looks like this \textbf{`` \^{} ''}; click on it; here find the green printer icon (PaperCut) and click on ``View Printers''.
\begin{itemize}
\item If you are prompted with a \textbf{login screen} then login with your @brookstoneschools.org credentials; go to ``install printers'' on the side of the screen and install the printers you need to use -> \textbf{Attempt to reprint}
\item otherwise, click refresh -> \textbf{Attempt to reprint}
\end{itemize}
\end{itemize}

\clearpage
\subsection{Macbook}
\label{sec:org60826e3}
\noindent\rule{\textwidth}{0.5pt}
\subsubsection{Printing}
\label{sec:orgbf02145}
Q: \texttt{I have sent a print job, however I do not see it in queue for release?}
\begin{itemize}
\item First -- Confirm you are connected to the ``Brookstone'' WiFi -> \textbf{Attempt to reprint if connected to a different network}
\item Else -- Open the settings application on your laptop; search for the devices and printers menu; click on the printer you sent the file to and open up the queue page:
\begin{itemize}
\item If you see your file here and a message that the queue/file is paused; right click on the document and click ``unpause queue'' -> \textbf{Check if your document has made it to the printer}
\end{itemize}

\item Else -- At the very top of your screen (near the date/time) look for a green printer icon (PaperCut) and click on ``View Printers''.
\begin{itemize}
\item If you are prompted with a \textbf{login screen} then login with your @brookstoneschools.org credentials; go to ``install printers'' on the side of the screen and install the printers you need to use -> \textbf{Attempt to reprint}
\item otherwise, click refresh -> \textbf{Attempt to reprint}
\end{itemize}
\end{itemize}


\clearpage
\section{iPads}
\label{sec:org7ddbd49}
\subsection{Apple Classroom}
\label{sec:orgb2e7136}
\noindent\rule{\textwidth}{0.5pt}
Q: \texttt{How do I set up Apple Classroom?}
\begin{itemize}
\item You can set up Apple Classroom using the instructions within this document: \href{https://docs.google.com/document/d/1VQ7f4V\_Gj16oRHccW3Lk0xK8nFByXDQ\_1gwRT2M16BY/edit?usp=sharing}{Apple Classroom Instructions}
\end{itemize}
\subsection{General}
\label{sec:orge38284d}
\noindent\rule{\textwidth}{0.5pt}
\subsubsection{Unresponsive iPad}
\label{sec:org16e31b7}
Q: \texttt{My iPad seems to be frozen | I cannot interact with the screen}
\begin{itemize}
\item In most cases, the best option is to hard restart the device; Press buttons in this order:
\begin{itemize}
\item Volume up, Volume down, then Hold down the power button until the screen shuts off completely.
\item Wait 10 seconds and then hold the power button again until the Apple Logo appears on the screen.
\end{itemize}
\item Once this is done, your iPad should function as intended. If not, please reach out to IT
\end{itemize}


\clearpage
\section{Chromebooks}
\label{sec:orgfdb1c6f}
\subsection{General}
\label{sec:org3c865e3}
\noindent\rule{\textwidth}{0.5pt}
Q: \texttt{How my students print with their chromebooks}
\begin{itemize}
\item All Chromebooks are currently set up with our print server (PaperCut), so printing should be a relatively painless process for students!
\begin{itemize}
\item Just as you would with your teacher laptops, selecting print on a document (or pressing ctrl + p) will open a window to select which printer you would like to send a job to.
\item Select your printer and follow the instructions listed on the screen; Once completed, retrieve the document from the printer!
\end{itemize}
\end{itemize}
\clearpage
\section{Smartboard}
\label{sec:org4940061}
\subsection{General}
\label{sec:orgffa5e46}
\noindent\rule{\textwidth}{0.5pt}
Q:
\end{document}
